#4. Программа принимает действительное положительное число x и целое отрицательное число y. Необходимо выполнить
# возведение числа x в степень y. Задание необходимо реализовать в виде функции my_func(x, y). При решении задания
# необходимо обойтись без встроенной функции возведения числа в степень.
#Подсказка: попробуйте решить задачу двумя способами. Первый — возведение в степень с помощью оператора **.
# Второй — более сложная реализация без оператора **, предусматривающая использование цикла.
def my_func(x, y):
    return x ** y


print(my_func(5, 0))

def my_func1(x, y):
    s = 1
    for i in range(abs(y)):
        s *= x
    return 1 / s if y < 0 else s


print(my_func1(5, -2))